app/controllers/kopis_controller.rb

SELECT "kopis".* FROM "kopis"
---
    def index
        @kopis = Kopi.all

SELECT "roasts".* FROM "roasts"
SELECT "origins".* FROM "origins"
---
    def new
        @roasts = Roast.all
        @origins = Origin.all

INSERT INTO "kopis" ("name", "roast_id", "origin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Cinnamon Latte"], ["roast_id", 1], ["origin_id", 1], ["created_at", "2020-05-14 17:51:17.652893"], ["updated_at", "2020-05-14 17:51:17.652893"]]
---
    def create
        @kopi = Kopi.new(kopi_params)

        @kopi.save

SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "origins".* FROM "origins" WHERE "origins"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "origins".* FROM "origins" WHERE "origins"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        @kopi = Kopi.find(params[:id])
        @origin = Origin.find(@kopi.origin_id)
        @roast = Roast.find(@kopi.roast_id)

SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "roasts".* FROM "roasts"
SELECT "origins".* FROM "origins"
---
    def edit
        @kopi = Kopi.find(params[:id])
        @roasts = Roast.all
        @origins = Origin.all

SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "kopis" SET "origin_id" = $1, "updated_at" = $2 WHERE "kopis"."id" = $3  [["origin_id", 4], ["updated_at", "2020-05-15 02:14:46.435324"], ["id", 1]]
---
     def update
        @kopi = Kopi.find(params[:id])

        @kopi.update(kopi_params)